app/Controllers/ActivityController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
---
    public function browse()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Veuillez d\'abord vous connecter');
        }

        try {
            $userId = session()->get('user_id');
            $user = $this->userModel->find($userId);