app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_gold` = 1
SELECT COUNT(*) AS `numrows`
FROM `regimes`
SELECT COUNT(*) AS `numrows`
FROM `codes_portefeuille`
SELECT COUNT(*) AS `numrows`
FROM `codes_portefeuille`
WHERE `valide` = 0
SELECT SUM(`prix_paye`) AS `prix_paye`
FROM `user_regimes`
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT `regimes`.`nom`, COUNT(user_regimes.id) as count
FROM `user_regimes`
JOIN `regimes` ON `regimes`.`id` = `user_regimes`.`regime_id`
WHERE `user_regimes`.`statut` = 'actif'
GROUP BY `regime_id`
ORDER BY `count` DESC
 LIMIT 5
---
    public function dashboard()
    {
        if ($redirect = $this->requireAdmin()) {
            return $redirect;
        }

        $db = Database::connect();

        // Statistiques générales
        $stats = [
            'total_users' => $this->userModel->countAllResults(),
            'total_regimes' => $this->regimeModel->countAllResults(),
            'total_activites' => $this->activiteModel->countAllResults(),
            'total_codes' => $db->table('codes_portefeuille')->countAllResults(),
            'codes_utilises' => $db->table('codes_portefeuille')->where('valide', false)->countAllResults(),
            'revenus_total' => $db->table('user_regimes')
                                 ->selectSum('prix_paye')
                                 ->get()
                                 ->getRowArray()['prix_paye'] ?? 0,
            'utilisateurs_gold' => $this->userModel->where('is_gold', true)->countAllResults(),
        ];

        // Derniers utilisateurs
        $derniers_users = $this->userModel->orderBy('created_at', 'DESC')->limit(5)->findAll();

        // Régimes populaires
        $regimes_populaires = $db->table('user_regimes')
                                 ->select('regimes.nom, COUNT(user_regimes.id) as count')
                                 ->join('regimes', 'regimes.id = user_regimes.regime_id')
                                 ->where('user_regimes.statut', 'actif')
                                 ->groupBy('regime_id')
                                 ->orderBy('count', 'DESC')
                                 ->limit(5)
                                 ->get()
                                 ->getResultArray();

SELECT SUM(`prix_paye`) AS `prix_paye`
FROM `user_regimes`
WHERE DATE_FORMAT(created_at, "%Y-%m") = '2025-12'
---
        $revenuesTrend = [];
        for ($i = 5; $i >= 0; $i--) {
            $date = date('Y-m', strtotime("-$i months"));
            $revenue = $db->table('user_regimes')
                         ->selectSum('prix_paye')
                         ->where('DATE_FORMAT(created_at, "%Y-%m") = ', $date)
                         ->get()
                         ->getRowArray()['prix_paye'] ?? 0;

SELECT *
FROM `users`
---
    public function users()
    {
        if ($redirect = $this->requireAdmin()) {
            return $redirect;
        }

        $users = $this->userModel->findAll();

SELECT *
FROM `regimes`
ORDER BY `created_at` DESC
---
    public function regimes()
    {
        if ($redirect = $this->requireAdmin()) {
            return $redirect;
        }

        $editId = (int) ($this->request->getGet('edit') ?? 0);
        $editingRegime = $editId ? $this->regimeModel->find($editId) : null;
        $regimes = $this->regimeModel->orderBy('created_at', 'DESC')->findAll();

SELECT `cp`.*, `users`.`username` as `utilisateur_username`
FROM `codes_portefeuille` `cp`
LEFT JOIN `users` ON `users`.`id` = `cp`.`utilisateur_id`
ORDER BY `cp`.`created_at` DESC
---
    public function codes()
    {
        if ($redirect = $this->requireAdmin()) {
            return $redirect;
        }

        $editId = (int) ($this->request->getGet('edit') ?? 0);
        $editingCode = $editId ? $this->codeModel->find($editId) : null;

        $db = Database::connect();
        $codes = $db->table('codes_portefeuille cp')
                   ->select('cp.*, users.username as utilisateur_username')
                   ->join('users', 'users.id = cp.utilisateur_id', 'left')
                   ->orderBy('cp.created_at', 'DESC')
                   ->get()
                   ->getResultArray();