app/Controllers/DashboardController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
---
    public function index()
    {
        // Vérifier authentification
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Veuillez d\'abord vous connecter');
        }

        // Rediriger les admins vers le dashboard admin
        if (session()->get('role') === 'admin') {
            return redirect()->to('/admin');
        }

        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
UPDATE `users` SET `solde_portefeuille` = 3.01, `is_gold` = 1, `updated_at` = '2026-05-12 17:17:16'
WHERE `users`.`id` IN ('6')
---
    public function buyGold()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Veuillez d\'abord vous connecter');
        }

        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);

        if ($user['is_gold']) {
            return redirect()->back()->with('error', 'Vous avez déjà l\'option Gold');
        }

        if ($user['solde_portefeuille'] < 9.99) {
            return redirect()->back()->with('error', 'Solde insuffisant (9.99€ requis)');
        }

        // Déduire et activer Gold
        $this->userModel->update($userId, [
            'solde_portefeuille' => $user['solde_portefeuille'] - 9.99,
            'is_gold' => true,
        ]);

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
---
    public function editProfile()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Veuillez d\'abord vous connecter');
        }

        $user = $this->userModel->find(session()->get('user_id'));