app/Controllers/RegimeController.php

    public function browse()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Veuillez d\'abord vous connecter');
        }

        try {
            $userId = session()->get('user_id');
            $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'

    public function select($regimeId)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Veuillez d\'abord vous connecter');
        }

        try {
            $userId = session()->get('user_id');
            $user = $this->userModel->find($userId);
            $regime = $this->regimeModel->find($regimeId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '4'

            // Insérer le régime pour l'utilisateur
            $db = Database::connect();
            $duree_jours = (int)$regime['duree_jours'];
            $db->table('user_regimes')->insert([
                'user_id' => $userId,
                'regime_id' => $regimeId,
                'prix_paye' => $prix_paye,
                'date_selection' => date('Y-m-d H:i:s'),
                'date_fin_prevu' => date('Y-m-d H:i:s', strtotime("+{$duree_jours} days")),
                'statut' => 'actif',
            ]);

            // Déduire du solde
            $newBalance = $user['solde_portefeuille'] - $prix_paye;
            $this->userModel->update($userId, [
                'solde_portefeuille' => $newBalance,
            ]);
---
INSERT INTO `user_regimes` (`user_id`, `regime_id`, `prix_paye`, `date_selection`, `date_fin_prevu`, `statut`) VALUES ('6', '4', 29.75, '2026-05-12 17:18:20', '2026-05-19 17:18:20', 'actif')
UPDATE `users` SET `solde_portefeuille` = 23.26, `updated_at` = '2026-05-12 17:18:20'
WHERE `users`.`id` IN ('6')

    public function active()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Veuillez d\'abord vous connecter');
        }

        try {
            $userId = session()->get('user_id');
            $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'