app/Models/ActiviteModel.php

SELECT `objectif_id`
FROM `user_objectifs`
WHERE `user_id` = '6'
---
    public function getRecommendedActivities($userId)
    {
        $db = Database::connect();

        // Recuperer les objectifs de l'utilisateur
        $userObjectifs = $db->table('user_objectifs')
                            ->select('objectif_id')
                            ->where('user_id', $userId)
                            ->get()
                            ->getResultArray();

SELECT `activites_sportives`.*, `user_activites`.`id` as `user_activite_id`, `user_activites`.`prix_paye`, `user_activites`.`date_selection`, `user_activites`.`date_fin_prevu`, `user_activites`.`statut`
FROM `activites_sportives`
JOIN `user_activites` ON `user_activites`.`activite_id` = `activites_sportives`.`id`
WHERE `user_activites`.`user_id` = '6'
AND `user_activites`.`statut` = 'actif'
---
    public function getUserActivities($userId)
    {
        $db = Database::connect();
        $result = $db->table('activites_sportives')
                     ->select('activites_sportives.*, user_activites.id as user_activite_id, user_activites.prix_paye, user_activites.date_selection, user_activites.date_fin_prevu, user_activites.statut')
                     ->join('user_activites', 'user_activites.activite_id = activites_sportives.id')
                     ->where('user_activites.user_id', $userId)
                     ->where('user_activites.statut', 'actif')
                     ->get()
                     ->getResultArray();

SELECT *
FROM `user_activites`
WHERE `user_id` = '6'
AND `activite_id` = '2'
AND `statut` = 'actif'
---
    public function hasUserSelectedActivity($userId, $activiteId)
    {
        $db = Database::connect();
        $result = $db->table('user_activites')
                     ->where('user_id', $userId)
                     ->where('activite_id', $activiteId)
                     ->where('statut', 'actif')
                     ->get()
                     ->getRowArray();