app/Models/ObjectifModel.php

    public function getUserObjectifs($userId)
    {
        return $this->select('objectifs.*')
                    ->join('user_objectifs', 'user_objectifs.objectif_id = objectifs.id')
                    ->where('user_objectifs.user_id', $userId)
                    ->findAll();
---
SELECT `objectifs`.*
FROM `objectifs`
JOIN `user_objectifs` ON `user_objectifs`.`objectif_id` = `objectifs`.`id`
WHERE `user_objectifs`.`user_id` = '6'

    public function deleteUserObjectifs($userId)
    {
        return $this->db->table('user_objectifs')
                        ->where('user_id', $userId)
                        ->delete();
---
DELETE FROM `user_objectifs`
WHERE `user_id` = '6'

    public function addUserObjectif($userId, $objectifId)
    {
        return $this->db->table('user_objectifs')->insert([
            'user_id' => $userId,
            'objectif_id' => $objectifId,
        ]);
---
INSERT INTO `user_objectifs` (`user_id`, `objectif_id`) VALUES ('6', 1)