app/Models/RegimeTarifModel.php

SELECT *
FROM `regime_tarifs`
WHERE `regime_id` = '4'
ORDER BY `duree_jours` ASC
---
    public function getByRegime($regimeId)
    {
        return $this->where('regime_id', $regimeId)
                   ->orderBy('duree_jours', 'ASC')
                   ->findAll();