app/Models/RegimeModel.php

SELECT `objectif_id`
FROM `user_objectifs`
WHERE `user_id` = '6'
---
    public function getRecommendedRegimes($userId)
    {
        $db = Database::connect();

        // Récupérer les objectifs de l'utilisateur
        $userObjectifs = $db->table('user_objectifs')
                            ->select('objectif_id')
                            ->where('user_id', $userId)
                            ->get()
                            ->getResultArray();

SELECT *
FROM `regimes`
WHERE `type` IN ('prise')
---
            return $this->findAll();
        }

        return $this->whereIn('type', $types)->findAll();

SELECT `regimes`.*, `user_regimes`.`id` as `user_regime_id`, `user_regimes`.`prix_paye`, `user_regimes`.`date_selection`, `user_regimes`.`date_fin_prevu`, `user_regimes`.`statut`
FROM `regimes`
JOIN `user_regimes` ON `user_regimes`.`regime_id` = `regimes`.`id`
WHERE `user_regimes`.`user_id` = '6'
AND `user_regimes`.`statut` = 'actif'
---
    public function getUserRegimes($userId)
    {
        $db = Database::connect();
        $result = $db->table('regimes')
                     ->select('regimes.*, user_regimes.id as user_regime_id, user_regimes.prix_paye, user_regimes.date_selection, user_regimes.date_fin_prevu, user_regimes.statut')
                     ->join('user_regimes', 'user_regimes.regime_id = regimes.id')
                     ->where('user_regimes.user_id', $userId)
                     ->where('user_regimes.statut', 'actif')
                     ->get()
                     ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `user_regimes`
WHERE `user_id` = '6'
AND `regime_id` = '4'
AND `statut` = 'actif'
---
    public function hasUserSelectedRegime($userId, $regimeId)
    {
        $db = Database::connect();
        return $db->table('user_regimes')
                  ->where('user_id', $userId)
                  ->where('regime_id', $regimeId)
                  ->where('statut', 'actif')
                  ->countAllResults() > 0;